public/dotfiles.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-20 Wed 20:58 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dotfiles</title>
<meta name="author" content="Aziz Ben Ali" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/stylesheets/main.css">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<ul class="navigation">
  <li> <a href="/index.html">Home</a> </li>
  <li> <a href="/contact.html">Contact</a> </li>
  <li> <a href="/resume.html">Résumé</a> </li>
</ul>
</div>
<div id="content" class="content">
<header>
<h1 class="title">dotfiles</h1>
</header>
<div id="outline-container-org47208b1" class="outline-2">
<h2 id="org47208b1">Preface</h2>
<div class="outline-text-2" id="text-org47208b1">
<p>
The documentation found herein follows the <a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming</a>
principle.
</p>

<p>
It's only possible thanks to the <a href="https://www.gnu.org/software/emacs/">Emacs</a> text editor, and the <a href="https://orgmode.org/">Org Mode</a>
ecosystem.
</p>

<p>
The documentation does not cover all of my configurations. Hence, I
invite you to <a href="https://git.sr.ht/~grtcdr/dotfiles">browse the repository</a> where the rest of my dotfiles
live.
</p>

<p>
Please note that a small but significant portion of my configurations,
is a mold of what I've read in a blog, seen in a demonstration, or
just adapted from someone else's dotfiles.
</p>

<hr>

<ul class="org-ul">
<li><p>
<a href="dotfiles/sway/sway.html">sway</a>
</p>

<p>
A concoction of functionalism and elegance, making use of the bare
minimum of software so as to achieve a coherent desktop environment
without one being present.
</p>

<ul class="org-ul">
<li><a href="dotfiles/sway/colorschemes.html">colorschemes</a></li>
<li><a href="dotfiles/swaylock/swaylock.html">swaylock</a></li>
<li><a href="dotfiles/mako/mako.html">mako</a></li>
</ul></li>

<li><p>
<a href="dotfiles/zsh/zsh.html">zsh</a>
</p>

<p>
A short <code>zsh</code> configuration targeting simplicity.
</p></li>

<li><p>
<a href="dotfiles/sh/doch.html">doch</a>
</p>

<p>
A shell script that lists and opens HTML/PDF files found within my
<code>org-directory</code>.
</p></li>

<li><p>
<a href="dotfiles/sh/startw.html">startw</a>
</p>

<p>
A shell script that intelligently starts <code>sway</code>.
</p></li>

<li><p>
<a href="dotfiles/sh/mus.html">mus</a>
</p>

<p>
A shell script that automates the starting and stopping of <code>mpd</code> and
<code>ncmpcpp</code>.
</p></li>
</ul>
</div>
</div>
</div>
</body>
</html>
